[
  {
    "id": 1,
    "title": "How to Brew the Perfect Cup of Coffee",
    "slug": "brew-perfect-cup-of-coffee",
    "excerpt": "Master the basics of brewing coffee and enjoy café-quality flavor at home.",
    "content": "Brewing the perfect cup of coffee begins with choosing high-quality, freshly roasted beans. Always grind your beans just before brewing to preserve aroma and flavor. Water quality matters just as much—use clean, filtered water and heat it to the right temperature, ideally between 90–96°C. The coffee-to-water ratio should be balanced, usually one to two tablespoons of coffee per cup. Finally, pay attention to brewing time, as over-extraction can make coffee bitter while under-extraction results in a weak cup. With practice and small adjustments, you can create a consistently delicious coffee experience at home.",
    "author": "Aarav Patel",
    "publishedDate": "2026-01-05",
    "readTime": "5 min read",
    "category": "Brewing Guide",
    "tags": ["brewing", "home coffee"],
    "coverImage": "/blogs/coffeemake.webp"
  },
  {
    "id": 2,
    "title": "Arabica vs Robusta: Understanding Coffee Beans",
    "slug": "arabica-vs-robusta",
    "excerpt": "A complete guide to the two most popular coffee bean varieties.",
    "content": "Arabica and Robusta beans dominate the global coffee market, yet they offer very different experiences. Arabica beans are known for their smooth, sweet, and aromatic flavors with hints of fruit and chocolate. Robusta beans, on the other hand, are stronger, more bitter, and contain significantly more caffeine. While Arabica grows best at higher altitudes, Robusta is more resilient and thrives in warmer climates. Understanding these differences helps coffee lovers choose beans that match their taste preferences and brewing methods.",
    "author": "Neha Sharma",
    "publishedDate": "2026-01-06",
    "readTime": "4 min read",
    "category": "Coffee Basics",
    "tags": ["coffee beans", "arabica", "robusta"],
    "coverImage": "/blogs/beans.webp"
  },
  {
    "id": 3,
    "title": "Why Fresh Coffee Beans Make a Big Difference",
    "slug": "fresh-coffee-beans-matter",
    "excerpt": "Freshness plays a crucial role in coffee flavor and aroma.",
    "content": "Coffee beans begin to lose their freshness soon after roasting. As time passes, essential oils and aromatic compounds slowly fade, resulting in dull and flat flavors. Fresh beans produce richer aromas, brighter acidity, and deeper complexity in every cup. For the best results, buy coffee in small batches and use it within a few weeks of roasting. Proper storage in airtight containers further helps preserve flavor and quality.",
    "author": "Rohit Verma",
    "publishedDate": "2026-01-07",
    "readTime": "4 min read",
    "category": "Coffee Tips",
    "tags": ["fresh coffee", "roasting"],
    "coverImage": "/blogs/collecting.webp"
  },
  {
    "id": 4,
    "title": "Coffee Grind Sizes and Their Impact on Taste",
    "slug": "coffee-grind-sizes",
    "excerpt": "Choosing the correct grind size can transform your coffee experience.",
    "content": "Grind size controls how water extracts flavor from coffee grounds. Coarse grinds work best for slow brewing methods like French press, while medium grinds are ideal for drip coffee makers. Fine grinds are essential for espresso, allowing quick extraction under pressure. Using the wrong grind size can result in bitter or sour coffee. Matching grind size to your brewing method ensures balanced flavor and optimal extraction.",
    "author": "Ananya Rao",
    "publishedDate": "2026-01-08",
    "readTime": "4 min read",
    "category": "Brewing Guide",
    "tags": ["grind size", "coffee brewing"],
    "coverImage": "/blogs/coffeetree.webp"
  },
  {
    "id": 5,
    "title": "Popular Coffee Brewing Methods Explained",
    "slug": "coffee-brewing-methods-explained",
    "excerpt": "Explore different brewing styles and find your favorite.",
    "content": "There are many ways to brew coffee, each offering a unique taste and texture. Pour-over brewing highlights clarity and subtle flavors, while French press produces a rich and full-bodied cup. Espresso delivers concentrated intensity, forming the base for popular drinks like lattes and cappuccinos. Experimenting with different brewing methods helps you discover the style that best suits your taste preferences.",
    "author": "Kunal Mehta",
    "publishedDate": "2026-01-09",
    "readTime": "5 min read",
    "category": "Brewing Guide",
    "tags": ["pour over", "french press", "espresso"],
    "coverImage": "/blogs/coffeemachine.webp"
  },
  {
    "id": 6,
    "title": "How to Store Coffee Beans for Maximum Freshness",
    "slug": "store-coffee-beans",
    "excerpt": "Learn the best storage practices to keep your coffee flavorful.",
    "content": "Proper storage protects coffee beans from air, moisture, heat, and light. Always store beans in an airtight container at room temperature. Avoid refrigeration, as moisture can damage flavor. Buying smaller quantities and storing them correctly ensures every cup tastes fresh and aromatic.",
    "author": "Sneha Iyer",
    "publishedDate": "2026-01-10",
    "readTime": "3 min read",
    "category": "Coffee Tips",
    "tags": ["coffee storage"],
    "coverImage": "/blogs/spooncoffee.webp"
  },
  {
    "id": 7,
    "title": "The Journey of Coffee: From Farm to Cup",
    "slug": "journey-of-coffee",
    "excerpt": "Discover how coffee travels from farms to your favorite mug.",
    "content": "Coffee begins its journey on farms where beans are carefully grown, harvested, and processed. After drying and roasting, beans are packaged and shipped worldwide. Each step in this journey affects flavor and quality, making responsible sourcing and careful roasting essential to great coffee.",
    "author": "Vikram Singh",
    "publishedDate": "2026-01-11",
    "readTime": "5 min read",
    "category": "Coffee Culture",
    "tags": ["coffee journey", "coffee culture"],
    "coverImage": "/blogs/farm.webp"
  },
  {
    "id": 8,
    "title": "Understanding Caffeine in Coffee",
    "slug": "understanding-caffeine",
    "excerpt": "How caffeine levels vary across different coffee types.",
    "content": "Caffeine content depends on bean variety, roast level, and brewing method. Robusta beans contain more caffeine than Arabica, while lighter roasts often retain more caffeine. Understanding these factors helps you choose coffee that matches your energy needs and lifestyle.",
    "author": "Pooja Malhotra",
    "publishedDate": "2026-01-12",
    "readTime": "4 min read",
    "category": "Coffee Facts",
    "tags": ["caffeine", "coffee facts"],
    "coverImage": "/blogs/makecoffee.webp"
  },
  {
    "id": 9,
    "title": "Why Sustainable Coffee Is Important",
    "slug": "sustainable-coffee",
    "excerpt": "Sustainability ensures a better future for coffee and farmers.",
    "content": "Sustainable coffee focuses on ethical farming practices, fair wages, and environmental protection. By choosing sustainably sourced coffee, consumers support farming communities and help preserve coffee production for future generations.",
    "author": "Meera Joshi",
    "publishedDate": "2026-01-13",
    "readTime": "5 min read",
    "category": "Sustainability",
    "tags": ["sustainable coffee", "ethical sourcing"],
    "coverImage": "/blogs/laptopcoffee.webp"
  }
]
